9MobileMTNUSSDBridge/src/main/java/wsdl/localhost_9000/Services.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.csapi.org/wsdl/parlayx/ussd/send/v1_0/service" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.csapi.org/wsdl/parlayx/ussd/send/v1_0/service" name="SendUssdService">
<types>
<xsd:schema>
<xsd:import namespace="http://www.csapi.org/schema/parlayx/ussd/send/v1_0/local" schemaLocation="http://localhost:9000/Services?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="sendUssd">
<part xmlns:ns1="http://www.csapi.org/schema/parlayx/ussd/send/v1_0/local" name="parameters" element="ns1:sendUssd"></part>
</message>
<message name="sendUssdResponse">
<part xmlns:ns2="http://www.csapi.org/schema/parlayx/ussd/send/v1_0/local" name="parameters" element="ns2:sendUssdResponse"></part>
</message>
<portType name="SendUssdServices">
<operation name="sendUssd">
<input wsam:Action="http://www.csapi.org/wsdl/parlayx/ussd/send/v1_0/service/SendUssdServices/sendUssdRequest" message="tns:sendUssd"></input>
<output wsam:Action="http://www.csapi.org/wsdl/parlayx/ussd/send/v1_0/service/SendUssdServices/sendUssdResponse" message="tns:sendUssdResponse"></output>
</operation>
</portType>
<binding name="SendUssdServicesPortBinding" type="tns:SendUssdServices">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="sendUssd">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="SendUssdService">
<port name="SendUssdServicesPort" binding="tns:SendUssdServicesPortBinding">
<soap:address location="http://localhost:9000/Services"></soap:address>
</port>
</service>
</definitions>